brew "zsh"
brew "neovim"
brew "nmap"
brew "watchman"
brew "gnu-sed"
brew "ripgrep"
brew "telnet"
brew "sqlite"
brew "pgcli"

brew "tldr"
brew "bat"
brew "colima"
brew "docker"
brew "htop"
brew "jq"
brew "fd"
brew "fzf"
brew "mas"
brew "tmux"
brew "wget"

brew "git"
brew "svn"
brew "git-lfs"

brew "awscli"
brew "aichat"
brew "direnv"
brew "helm"
brew "k9s"
brew "kubectl"

brew "httpie"
brew "websocat"

brew "lazygit"
brew "jenv"
brew "lsd"
brew "node"
brew "go"
brew "gomi"
brew "lima"
brew "python"
brew "pyenv"
brew "nodenv"
brew "cmake"
brew "zimfw"
brew "zoxide"
brew "rust"

cask "font-d2coding"
cask "font-hack"
cask "font-meslo-lg-nerd-font"
cask "font-nanum-gothic"
cask "font-nanum-myeongjo"
cask "font-noto-sans-cjk-jp"
cask "font-noto-sans-cjk-kr"

cask "google-chrome"
cask "iterm2"
cask "notion"
cask "slack"
cask "the-unarchiver"
cask "zed"
cask "keepingyouawake"
cask "db-browser-for-sqlite"
cask "httpie"
cask "transmit"
