tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "neovim/neovim"

brew "libpng"
brew "freetype"
brew "fontconfig"
brew "gettext"
brew "libffi"
brew "pcre"
brew "sqlite"
brew "xz"
brew "glib"
brew "cairo"
brew "jpeg"
brew "libtiff"
brew "icu4c"
brew "harfbuzz"
brew "pango"
brew "amazon-ecs-cli"
brew "ansible"
brew "atk"
brew "autoconf"
brew "automake"
brew "autojump"
brew "awscli"
brew "axel"
brew "bat"
brew "buildkit"
brew "cmake"
brew "mpfr"
brew "libmpc"
brew "gcc"
brew "libtool"
brew "cfssl"
brew "click"
brew "coreutils"
brew "jemalloc"
brew "openssl@1.1"
brew "libevent"
brew "libidn"
brew "dockutil"
brew "libunistring"
brew "libtasn1"
brew "nettle"
brew "p11-kit"
brew "gnutls"
brew "findutils"
brew "unixodbc"
brew "fx"
brew "fzf"
brew "git"
brew "git-lfs"
brew "gnu-sed"
brew "pkg-config"
brew "gobject-introspection"
brew "hicolor-icon-theme"
brew "htop"
brew "shared-mime-info"
brew "imagemagick"
brew "jenv"
brew "jq"
brew "kubectx"
brew "kubernetes-helm"
brew "libtermkey"
brew "libuv"
brew "libvterm"
brew "libxml2"
brew "lzlib"
brew "mackup"
brew "mas"
brew "mercurial"
brew "protobuf"
brew "mitmproxy"
brew "moreutils"
brew "mosh"
brew "msgpack"
brew "unibilium"
brew "neovim"
brew "nmap"
brew "qemu"
brew "ripgrep"
brew "skaffold"
brew "telnet"
brew "tldr"
brew "tmux"
brew "watchman"
brew "wget"
brew "xhyve", args: ["HEAD"]
brew "zlib"
brew "zsh"

cask "arduino"
cask "authy"
cask "busycal"
cask "chromedriver"
cask "datagrip"
cask "docker"
cask "goland"
cask "google-chrome"
cask "google-cloud-sdk"
cask "hex-fiend"
cask "intellij-idea"
cask "iterm2"
cask "macdown"
cask "microsoft-office"
cask "notion"
cask "paw"
cask "slack"
cask "telegram-desktop-dev"
cask "the-unarchiver"
cask "tower"
cask "visual-studio-code"
cask "zeplin"
cask "keepingyouawake"
cask "rocket"

cask "java"
brew "node"
brew "go"
brew "python"
brew "dep"
brew "pipenv"
brew "pyenv"
brew "pyenv-virtualenv"
brew "pypy"

cask "font-d2coding"
cask "font-hack"
cask "font-meslo-for-powerline"
cask "font-nanumgothic"
cask "font-nanummyeongjo"
cask "font-noto-sans-cjk-jp"
cask "font-noto-sans-cjk-kr"
cask "font-ubuntu"

mas "BetterSnapTool", id: 417375580
mas "Boom 2", id: 948176063
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "KakaoTalk", id: 869223134
mas "Keynote", id: 409183694
mas "Movist", id: 461788075
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Transmit", id: 403388562
mas "Jira", id: 454347770
