# tap brew
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/versions'
tap 'homebrew/dupes'
tap 'homebrew/services'
tap 'homebrew/gui'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'neovim/neovim'
tap 'homebrew/php'

cask_args appdir: '/Applications'

# brew install
brew 'autoconf'
brew 'automake'
brew 'coreutils'
brew 'findutils'
brew 'moreutils'
brew 'wget', args: ['with-iri']
brew 'gnu-sed', args: ['with-default-names']
brew 'cmake'
brew 'gdbm'
brew 'gettext'
brew 'pcre'
brew 'git'
brew 'git-lfs'
brew 'libtool'
brew 'python'
brew 'libxml2', args: ['with-python']
brew 'lzlib'
brew 'pkg-config'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'zsh'
brew 'homebrew/versions/libxml278'
brew 'neovim/neovim/neovim'
brew 'tmux'
brew 'mas'
brew 'tig'
brew 'nginx'
brew 'php70', args: ['without-apache', 'with-fpm', 'with-mysql']
brew 'mackup'
brew 'mysql'
brew 'mosh'
brew 'gtkwave'
brew 'icarus-verilog'
brew 'golang'
brew 'dockutil'

# cask applications
cask 'gpgtools'
cask 'intellij-idea-ce'
cask 'iterm2'
cask 'google-chrome'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'sublime-text-dev'
cask 'telegram-desktop-dev'
cask 'adobe-photoshop-cc'
cask 'adobe-photoshop-lightroom'
cask 'tower'
cask 'sqlitebrowser'
cask 'macdown'
cask 'busycal'
cask 'utorrent'
cask 'istat-menus'
cask 'android-studio'
cask 'xamarin-studio'
cask 'mono-mdk'
cask 'paw'
cask 'santa'
cask 'alcatraz'
cask 'arduino'
cask 'macspice'
cask 'microsoft-office'
cask 'KeepingYouAwake'
cask 'the-unarchiver'
cask 'genymotion'
cask 'hex-fiend'
cask 'gureumkim'

# cask fonts
cask 'font-d2coding'
cask 'font-hack'
cask 'font-meslo-lg-for-powerline'
cask 'font-meslo-lg'
cask 'font-nanumgothic'
cask 'font-nanummyeongjo'

# Mac app store application
mas 'KakaoTalk', id: 869223134
mas 'iCircuit', id: 454347770
mas 'BetterSnapTool', id: 417375580
mas 'Movist', id: 461788075
mas 'Transmit', id: 403388562
mas 'Xcode', id: 497799835
mas 'Toad', id: 747961939
mas 'Boom 2: The Best Audio Enhancement App', id: 948176063
mas 'Microsoft Remote Desktop', id: 715768417

